app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(id: "DESC")
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC

  def create
    post = Post.create(content: params[:content], checked: false)
---
INSERT INTO `posts` (`content`, `checked`, `created_at`, `updated_at`) VALUES ('test111', FALSE, '2020-10-02 09:41:41.758018', '2020-10-02 09:41:41.758018')

  def checked
    post = Post.find(params[:id])
    if post.checked
      post.update(checked: false)
    else
      post.update(checked: true)
    end

    item = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`checked` = FALSE, `posts`.`updated_at` = '2020-10-02 08:23:40.451459' WHERE `posts`.`id` = 1
UPDATE `posts` SET `posts`.`checked` = TRUE, `posts`.`updated_at` = '2020-10-02 08:23:40.500393' WHERE `posts`.`id` = 1